src/InformationRegisters/НастройкиОчисткиУстаревшихДанных/НастройкиОчисткиУстаревшихДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОчисткиУстаревшихДанных</name>
  <resources>
    <name>Измерение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГлубинаХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УсловияОтбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИзмерениеГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаданий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИзмерениеОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиОчисткиУстаревшихДанных/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоответствиеОбъектов.Загрузить(РегистрыСведений.НастройкиОчисткиУстаревшихДанных.СоответствиеОбъектов());
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Метаданные", СоответствиеОбъектов);
	ОткрытьФорму("РегистрСведений.НастройкиОчисткиУстаревшихДанных.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ПараметрыОткрытия = Новый Структура;
	СтрДанные = Элементы.Список.ТекущиеДанные;
	ПараметрыОткрытия.Вставить("Ключ", КлючЗаписи(СтрДанные.ИмяОбъектаМетаданных, СтрДанные.ИзмерениеОтбора));
	ПараметрыОткрытия.Вставить("Метаданные", СоответствиеОбъектов);
	ОткрытьФорму("РегистрСведений.НастройкиОчисткиУстаревшихДанных.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	СтрДанные = Элементы.Список.ТекущиеДанные;
	ПараметрыОткрытия.Вставить("Ключ", КлючЗаписи(СтрДанные.ИмяОбъектаМетаданных, СтрДанные.ИзмерениеОтбора));
	ПараметрыОткрытия.Вставить("Метаданные", СоответствиеОбъектов);
	ОткрытьФорму("РегистрСведений.НастройкиОчисткиУстаревшихДанных.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма);
КонецПроцедуры

#КонецОбласти


#Область СлужбеныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КлючЗаписи(ИмяОбъектаМетаданных, ИзмерениеОтбора)
	Возврат РегистрыСведений.НастройкиОчисткиУстаревшихДанных.СоздатьКлючЗаписи(Новый Структура("ИмяОбъектаМетаданных, ИзмерениеОтбора", ИмяОбъектаМетаданных, ИзмерениеОтбора));
КонецФункции

#КонецОбласти
